#### Terraform Format and Style 🖌``
#### Terraform Initialization ⚙️`success`
#### Terraform Plan 📖`success`
<details><summary>Show Plan</summary>
```hcl
time=2024-04-12T20:30:09Z level=info msg=The stack at /github/workspace will be processed in the following order for command plan:%0AGroup 1%0A- Module /github/workspace/prod/network%0A%0AGroup 2%0A- Module /github/workspace/prod/eks%0A%0A%0AAcquiring state lock. This may take a few moments...%0A%0ATerraform used the selected providers to generate the following execution%0Aplan. Resource actions are indicated with the following symbols:%0A  + create%0A%0ATerraform will perform the following actions:%0A%0A  # aws_eip.this will be created%0A  + resource "aws_eip" "this" {%0A      + allocation_id        = (known after apply)%0A      + association_id       = (known after apply)%0A      + carrier_ip           = (known after apply)%0A      + customer_owned_ip    = (known after apply)%0A      + domain               = (known after apply)%0A      + id                   = (known after apply)%0A      + instance             = (known after apply)%0A      + network_border_group = (known after apply)%0A      + network_interface    = (known after apply)%0A      + private_dns          = (known after apply)%0A      + private_ip           = (known after apply)%0A      + public_dns           = (known after apply)%0A      + public_ip            = (known after apply)%0A      + public_ipv4_pool     = (known after apply)%0A      + tags                 = {%0A          + "Name" = "prod-nat"%0A        }%0A      + tags_all             = {%0A          + "Name" = "prod-nat"%0A        }%0A      + vpc                  = true%0A    }%0A%0A  # aws_internet_gateway.this will be created%0A  + resource "aws_internet_gateway" "this" {%0A      + arn      = (known after apply)%0A      + id       = (known after apply)%0A      + owner_id = (known after apply)%0A      + tags     = {%0A          + "Name" = "prod-igw"%0A        }%0A      + tags_all = {%0A          + "Name" = "prod-igw"%0A        }%0A      + vpc_id   = (known after apply)%0A    }%0A%0A  # aws_nat_gateway.this will be created%0A  + resource "aws_nat_gateway" "this" {%0A      + allocation_id        = (known after apply)%0A      + association_id       = (known after apply)%0A      + connectivity_type    = "public"%0A      + id                   = (known after apply)%0A      + network_interface_id = (known after apply)%0A      + private_ip           = (known after apply)%0A      + public_ip            = (known after apply)%0A      + subnet_id            = (known after apply)%0A      + tags                 = {%0A          + "Name" = "prod-nat"%0A        }%0A      + tags_all             = {%0A          + "Name" = "prod-nat"%0A        }%0A    }%0A%0A  # aws_route_table.private will be created%0A  + resource "aws_route_table" "private" {%0A      + arn              = (known after apply)%0A      + id               = (known after apply)%0A      + owner_id         = (known after apply)%0A      + propagating_vgws = (known after apply)%0A      + route            = [%0A          + {%0A              + cidr_block                 = "0.0.0.0/0"%0A              + nat_gateway_id             = (known after apply)%0A                # (12 unchanged attributes hidden)%0A            },%0A        ]%0A      + tags             = {%0A          + "Name" = "prod-private"%0A        }%0A      + tags_all         = {%0A          + "Name" = "prod-private"%0A        }%0A      + vpc_id           = (known after apply)%0A    }%0A%0A  # aws_route_table.public will be created%0A  + resource "aws_route_table" "public" {%0A      + arn              = (known after apply)%0A      + id               = (known after apply)%0A      + owner_id         = (known after apply)%0A      + propagating_vgws = (known after apply)%0A      + route            = [%0A          + {%0A              + cidr_block                 = "0.0.0.0/0"%0A              + gateway_id                 = (known after apply)%0A                # (12 unchanged attributes hidden)%0A            },%0A        ]%0A      + tags             = {%0A          + "Name" = "prod-public"%0A        }%0A      + tags_all         = {%0A          + "Name" = "prod-public"%0A        }%0A      + vpc_id           = (known after apply)%0A    }%0A%0A  # aws_route_table_association.private[0] will be created%0A  + resource "aws_route_table_association" "private" {%0A      + id             = (known after apply)%0A      + route_table_id = (known after apply)%0A      + subnet_id      = (known after apply)%0A    }%0A%0A  # aws_route_table_association.private[1] will be created%0A  + resource "aws_route_table_association" "private" {%0A      + id             = (known after apply)%0A      + route_table_id = (known after apply)%0A      + subnet_id      = (known after apply)%0A    }%0A%0A  # aws_route_table_association.public[0] will be created%0A  + resource "aws_route_table_association" "public" {%0A      + id             = (known after apply)%0A      + route_table_id = (known after apply)%0A      + subnet_id      = (known after apply)%0A    }%0A%0A  # aws_route_table_association.public[1] will be created%0A  + resource "aws_route_table_association" "public" {%0A      + id             = (known after apply)%0A      + route_table_id = (known after apply)%0A      + subnet_id      = (known after apply)%0A    }%0A%0A  # aws_security_group.this will be created%0A  + resource "aws_security_group" "this" {%0A      + arn                    = (known after apply)%0A      + description            = "Allow TLS inbound traffic and all outbound traffic"%0A      + egress                 = (known after apply)%0A      + id                     = (known after apply)%0A      + ingress                = (known after apply)%0A      + name                   = "this"%0A      + name_prefix            = (known after apply)%0A      + owner_id               = (known after apply)%0A      + revoke_rules_on_delete = false%0A      + tags                   = {%0A          + "Name" = "prod-main"%0A        }%0A      + tags_all               = {%0A          + "Name" = "prod-main"%0A        }%0A      + vpc_id                 = (known after apply)%0A    }%0A%0A  # aws_security_group_rule.allow_inbound[0] will be created%0A  + resource "aws_security_group_rule" "allow_inbound" {%0A      + cidr_blocks              = [%0A          + "0.0.0.0/0",%0A        ]%0A      + from_port                = 22%0A      + id                       = (known after apply)%0A      + protocol                 = "tcp"%0A      + security_group_id        = (known after apply)%0A      + security_group_rule_id   = (known after apply)%0A      + self                     = false%0A      + source_security_group_id = (known after apply)%0A      + to_port                  = 22%0A      + type                     = "ingress"%0A    }%0A%0A  # aws_security_group_rule.allow_inbound[1] will be created%0A  + resource "aws_security_group_rule" "allow_inbound" {%0A      + cidr_blocks              = [%0A          + "0.0.0.0/0",%0A        ]%0A      + from_port                = 443%0A      + id                       = (known after apply)%0A      + protocol                 = "tcp"%0A      + security_group_id        = (known after apply)%0A      + security_group_rule_id   = (known after apply)%0A      + self                     = false%0A      + source_security_group_id = (known after apply)%0A      + to_port                  = 443%0A      + type                     = "ingress"%0A    }%0A%0A  # aws_security_group_rule.allow_outbound[0] will be created%0A  + resource "aws_security_group_rule" "allow_outbound" {%0A      + cidr_blocks              = [%0A          + "0.0.0.0/0",%0A        ]%0A      + from_port                = 0%0A      + id                       = (known after apply)%0A      + protocol                 = "-1"%0A      + security_group_id        = (known after apply)%0A      + security_group_rule_id   = (known after apply)%0A      + self                     = false%0A      + source_security_group_id = (known after apply)%0A      + to_port                  = 0%0A      + type                     = "egress"%0A    }%0A%0A  # aws_subnet.private[0] will be created%0A  + resource "aws_subnet" "private" {%0A      + arn                                            = (known after apply)%0A      + assign_ipv6_address_on_creation                = false%0A      + availability_zone                              = "eu-central-1a"%0A      + availability_zone_id                           = (known after apply)%0A      + cidr_block                                     = "10.0.0.0/19"%0A      + enable_dns64                                   = false%0A      + enable_resource_name_dns_a_record_on_launch    = false%0A      + enable_resource_name_dns_aaaa_record_on_launch = false%0A      + id                                             = (known after apply)%0A      + ipv6_cidr_block_association_id                 = (known after apply)%0A      + ipv6_native                                    = false%0A      + map_public_ip_on_launch                        = false%0A      + owner_id                                       = (known after apply)%0A      + private_dns_hostname_type_on_launch            = (known after apply)%0A      + tags                                           = {%0A          + "Name"                            = "prod-private-eu-central-1a"%0A          + "kubernetes.io/cluster/prod"      = "owned"%0A          + "kubernetes.io/role/internal-elb" = "1"%0A        }%0A      + tags_all                                       = {%0A          + "Name"                            = "prod-private-eu-central-1a"%0A          + "kubernetes.io/cluster/prod"      = "owned"%0A          + "kubernetes.io/role/internal-elb" = "1"%0A        }%0A      + vpc_id                                         = (known after apply)%0A    }%0A%0A  # aws_subnet.private[1] will be created%0A  + resource "aws_subnet" "private" {%0A      + arn                                            = (known after apply)%0A      + assign_ipv6_address_on_creation                = false%0A      + availability_zone                              = "eu-central-1b"%0A      + availability_zone_id                           = (known after apply)%0A      + cidr_block                                     = "10.0.32.0/19"%0A      + enable_dns64                                   = false%0A      + enable_resource_name_dns_a_record_on_launch    = false%0A      + enable_resource_name_dns_aaaa_record_on_launch = false%0A      + id                                             = (known after apply)%0A      + ipv6_cidr_block_association_id                 = (known after apply)%0A      + ipv6_native                                    = false%0A      + map_public_ip_on_launch                        = false%0A      + owner_id                                       = (known after apply)%0A      + private_dns_hostname_type_on_launch            = (known after apply)%0A      + tags                                           = {%0A          + "Name"                            = "prod-private-eu-central-1b"%0A          + "kubernetes.io/cluster/prod"      = "owned"%0A          + "kubernetes.io/role/internal-elb" = "1"%0A        }%0A      + tags_all                                       = {%0A          + "Name"                            = "prod-private-eu-central-1b"%0A          + "kubernetes.io/cluster/prod"      = "owned"%0A          + "kubernetes.io/role/internal-elb" = "1"%0A        }%0A      + vpc_id                                         = (known after apply)%0A    }%0A%0A  # aws_subnet.public[0] will be created%0A  + resource "aws_subnet" "public" {%0A      + arn                                            = (known after apply)%0A      + assign_ipv6_address_on_creation                = false%0A      + availability_zone                              = "eu-central-1a"%0A      + availability_zone_id                           = (known after apply)%0A      + cidr_block                                     = "10.0.64.0/19"%0A      + enable_dns64                                   = false%0A      + enable_resource_name_dns_a_record_on_launch    = false%0A      + enable_resource_name_dns_aaaa_record_on_launch = false%0A      + id                                             = (known after apply)%0A      + ipv6_cidr_block_association_id                 = (known after apply)%0A      + ipv6_native                                    = false%0A      + map_public_ip_on_launch                        = false%0A      + owner_id                                       = (known after apply)%0A      + private_dns_hostname_type_on_launch            = (known after apply)%0A      + tags                                           = {%0A          + "Name"                       = "prod-public-eu-central-1a"%0A          + "kubernetes.io/cluster/prod" = "owned"%0A          + "kubernetes.io/role/elb"     = "1"%0A        }%0A      + tags_all                                       = {%0A          + "Name"                       = "prod-public-eu-central-1a"%0A          + "kubernetes.io/cluster/prod" = "owned"%0A          + "kubernetes.io/role/elb"     = "1"%0A        }%0A      + vpc_id                                         = (known after apply)%0A    }%0A%0A  # aws_subnet.public[1] will be created%0A  + resource "aws_subnet" "public" {%0A      + arn                                            = (known after apply)%0A      + assign_ipv6_address_on_creation                = false%0A      + availability_zone                              = "eu-central-1b"%0A      + availability_zone_id                           = (known after apply)%0A      + cidr_block                                     = "10.0.96.0/19"%0A      + enable_dns64                                   = false%0A      + enable_resource_name_dns_a_record_on_launch    = false%0A      + enable_resource_name_dns_aaaa_record_on_launch = false%0A      + id                                             = (known after apply)%0A      + ipv6_cidr_block_association_id                 = (known after apply)%0A      + ipv6_native                                    = false%0A      + map_public_ip_on_launch                        = false%0A      + owner_id                                       = (known after apply)%0A      + private_dns_hostname_type_on_launch            = (known after apply)%0A      + tags                                           = {%0A          + "Name"                       = "prod-public-eu-central-1b"%0A          + "kubernetes.io/cluster/prod" = "owned"%0A          + "kubernetes.io/role/elb"     = "1"%0A        }%0A      + tags_all                                       = {%0A          + "Name"                       = "prod-public-eu-central-1b"%0A          + "kubernetes.io/cluster/prod" = "owned"%0A          + "kubernetes.io/role/elb"     = "1"%0A        }%0A      + vpc_id                                         = (known after apply)%0A    }%0A%0A  # aws_vpc.this will be created%0A  + resource "aws_vpc" "this" {%0A      + arn                                  = (known after apply)%0A      + cidr_block                           = "10.0.0.0/16"%0A      + default_network_acl_id               = (known after apply)%0A      + default_route_table_id               = (known after apply)%0A      + default_security_group_id            = (known after apply)%0A      + dhcp_options_id                      = (known after apply)%0A      + enable_classiclink                   = (known after apply)%0A      + enable_classiclink_dns_support       = (known after apply)%0A      + enable_dns_hostnames                 = true%0A      + enable_dns_support                   = true%0A      + enable_network_address_usage_metrics = (known after apply)%0A      + id                                   = (known after apply)%0A      + instance_tenancy                     = "default"%0A      + ipv6_association_id                  = (known after apply)%0A      + ipv6_cidr_block                      = (known after apply)%0A      + ipv6_cidr_block_network_border_group = (known after apply)%0A      + main_route_table_id                  = (known after apply)%0A      + owner_id                             = (known after apply)%0A      + tags                                 = {%0A          + "Name" = "Frankfurt-prod"%0A        }%0A      + tags_all                             = {%0A          + "Name" = "Frankfurt-prod"%0A        }%0A    }%0A%0APlan: 18 to add, 0 to change, 0 to destroy.%0A%0AChanges to Outputs:%0A  + aws_security_group_rules_allow_inbound  = [%0A      + (known after apply),%0A      + (known after apply),%0A    ]%0A  + aws_security_group_rules_allow_outbound = [%0A      + (known after apply),%0A    ]%0A  + private_subnet_ids                      = [%0A      + (known after apply),%0A      + (known after apply),%0A    ]%0A  + public_subnet_ids                       = [%0A      + (known after apply),%0A      + (known after apply),%0A    ]%0A  + vpc_id                                  = (known after apply)%0AAcquiring state lock. This may take a few moments...%0A%0ATerraform used the selected providers to generate the following execution%0Aplan. Resource actions are indicated with the following symbols:%0A  + create%0A %3C= read (data resources)%0A%0ATerraform will perform the following actions:%0A%0A  # data.tls_certificate.this[0] will be read during apply%0A  # (config refers to values not yet known)%0A %3C= data "tls_certificate" "this" {%0A      + certificates = (known after apply)%0A      + id           = (known after apply)%0A      + url          = (known after apply)%0A    }%0A%0A  # aws_eks_cluster.this will be created%0A  + resource "aws_eks_cluster" "this" {%0A      + arn                   = (known after apply)%0A      + certificate_authority = (known after apply)%0A      + cluster_id            = (known after apply)%0A      + created_at            = (known after apply)%0A      + endpoint              = (known after apply)%0A      + id                    = (known after apply)%0A      + identity              = (known after apply)%0A      + name                  = "prod-kubernetes"%0A      + platform_version      = (known after apply)%0A      + role_arn              = (known after apply)%0A      + status                = (known after apply)%0A      + tags_all              = (known after apply)%0A      + version               = "1.29"%0A%0A      + vpc_config {%0A          + cluster_security_group_id = (known after apply)%0A          + endpoint_private_access   = false%0A          + endpoint_public_access    = true%0A          + public_access_cidrs       = (known after apply)%0A          + subnet_ids                = [%0A              + "subnet-1234",%0A              + "subnet-5678",%0A            ]%0A          + vpc_id                    = (known after apply)%0A        }%0A    }%0A%0A  # aws_eks_node_group.this["general"] will be created%0A  + resource "aws_eks_node_group" "this" {%0A      + ami_type               = (known after apply)%0A      + arn                    = (known after apply)%0A      + capacity_type          = "ON_DEMAND"%0A      + cluster_name           = "prod-kubernetes"%0A      + disk_size              = (known after apply)%0A      + id                     = (known after apply)%0A      + instance_types         = [%0A          + "t2.micro",%0A        ]%0A      + labels                 = {%0A          + "role" = "general"%0A        }%0A      + node_group_name        = "general"%0A      + node_group_name_prefix = (known after apply)%0A      + node_role_arn          = (known after apply)%0A      + release_version        = (known after apply)%0A      + resources              = (known after apply)%0A      + status                 = (known after apply)%0A      + subnet_ids             = [%0A          + "subnet-1234",%0A          + "subnet-5678",%0A        ]%0A      + tags_all               = (known after apply)%0A      + version                = (known after apply)%0A%0A      + scaling_config {%0A          + desired_size = 2%0A          + max_size     = 10%0A          + min_size     = 2%0A        }%0A%0A      + update_config {%0A          + max_unavailable = 1%0A        }%0A    }%0A%0A  # aws_iam_openid_connect_provider.this[0] will be created%0A  + resource "aws_iam_openid_connect_provider" "this" {%0A      + arn             = (known after apply)%0A      + client_id_list  = [%0A          + "sts.amazonaws.com",%0A        ]%0A      + id              = (known after apply)%0A      + tags_all        = (known after apply)%0A      + thumbprint_list = (known after apply)%0A      + url             = (known after apply)%0A    }%0A%0A  # aws_iam_role.eks will be created%0A  + resource "aws_iam_role" "eks" {%0A      + arn                   = (known after apply)%0A      + assume_role_policy    = jsonencode(%0A            {%0A              + Statement = [%0A                  + {%0A                      + Action    = "sts:AssumeRole"%0A                      + Effect    = "Allow"%0A                      + Principal = {%0A                          + Service = "eks.amazonaws.com"%0A                        }%0A                    },%0A                ]%0A              + Version   = "2012-10-17"%0A            }%0A        )%0A      + create_date           = (known after apply)%0A      + force_detach_policies = false%0A      + id                    = (known after apply)%0A      + managed_policy_arns   = (known after apply)%0A      + max_session_duration  = 3600%0A      + name                  = "prod-kubernetes-eks-cluster"%0A      + name_prefix           = (known after apply)%0A      + path                  = "/"%0A      + role_last_used        = (known after apply)%0A      + tags_all              = (known after apply)%0A      + unique_id             = (known after apply)%0A    }%0A%0A  # aws_iam_role.nodes will be created%0A  + resource "aws_iam_role" "nodes" {%0A      + arn                   = (known after apply)%0A      + assume_role_policy    = jsonencode(%0A            {%0A              + Statement = [%0A                  + {%0A                      + Action    = "sts:AssumeRole"%0A                      + Effect    = "Allow"%0A                      + Principal = {%0A                          + Service = "ec2.amazonaws.com"%0A                        }%0A                    },%0A                ]%0A              + Version   = "2012-10-17"%0A            }%0A        )%0A      + create_date           = (known after apply)%0A      + force_detach_policies = false%0A      + id                    = (known after apply)%0A      + managed_policy_arns   = (known after apply)%0A      + max_session_duration  = 3600%0A      + name                  = "prod-kubernetes-eks-nodes"%0A      + name_prefix           = (known after apply)%0A      + path                  = "/"%0A      + role_last_used        = (known after apply)%0A      + tags_all              = (known after apply)%0A      + unique_id             = (known after apply)%0A    }%0A%0A  # aws_iam_role_policy_attachment.eks will be created%0A  + resource "aws_iam_role_policy_attachment" "eks" {%0A      + id         = (known after apply)%0A      + policy_arn = "arn:aws:iam::aws:policy/AmazonEKSClusterPolicy"%0A      + role       = "prod-kubernetes-eks-cluster"%0A    }%0A%0A  # aws_iam_role_policy_attachment.nodes["1"] will be created%0A  + resource "aws_iam_role_policy_attachment" "nodes" {%0A      + id         = (known after apply)%0A      + policy_arn = "arn:aws:iam::aws:policy/AmazonEKSWorkerNodePolicy"%0A      + role       = "prod-kubernetes-eks-nodes"%0A    }%0A%0A  # aws_iam_role_policy_attachment.nodes["2"] will be created%0A  + resource "aws_iam_role_policy_attachment" "nodes" {%0A      + id         = (known after apply)%0A      + policy_arn = "arn:aws:iam::aws:policy/AmazonEKS_CNI_Policy"%0A      + role       = "prod-kubernetes-eks-nodes"%0A    }%0A%0A  # aws_iam_role_policy_attachment.nodes["3"] will be created%0A  + resource "aws_iam_role_policy_attachment" "nodes" {%0A      + id         = (known after apply)%0A      + policy_arn = "arn:aws:iam::aws:policy/AmazonEC2ContainerRegistryReadOnly"%0A      + role       = "prod-kubernetes-eks-nodes"%0A    }%0A%0A  # aws_iam_role_policy_attachment.nodes["4"] will be created%0A  + resource "aws_iam_role_policy_attachment" "nodes" {%0A      + id         = (known after apply)%0A      + policy_arn = "arn:aws:iam::aws:policy/AmazonSSMManagedInstanceCore"%0A      + role       = "prod-kubernetes-eks-nodes"%0A    }%0A%0APlan: 10 to add, 0 to change, 0 to destroy.%0A%0AChanges to Outputs:%0A  + eks_name            = "prod-kubernetes"%0A  + openid_provider_arn = (known after apply)
```
</details>
**Pusher**: @SviatoslavKozak
**Action**: pull_request
